local opt = vim.opt

------------------------------------------------------------
-- ОБЩИЕ НАСТРОЙКИ
------------------------------------------------------------
opt.mouse = 'a'              					 --Включит мышь
opt.encoding = 'utf-8'                 --Кодировка
opt.showcmd = true                     --Отображение команд
opt.swapfile = false                   --Не создаем свап файлы
opt.clipboard:append('unnamedplus')    --Общий буфер
opt.scrolloff = 10

------------------------------------------------------------
-- ВИЗУАЛЬНЫЕ ОПЦИИ
------------------------------------------------------------

opt.relativenumber = true            --Номер строк сбоку
opt.wrap = true              --Длинные линии будет видно
opt.tabstop = 4              --1 tab = 4 пробела
opt.smartindent = true       --Автоматические отступы
opt.shiftwidth = 4           --Смещаем на 4 пробела
opt.foldcolumn = '2'         --Ширина колонки для фолдов
opt.colorcolumn =  '119'     --Расположение цветной колонки
opt.cursorline = true        -- Подсветка строки с курсором
opt.termguicolors = false
vim.cmd 'colorscheme catppuccin-mocha'

-----------------------------------------------------------
-- НАСТРОЙКИ ПОИСКА
-----------------------------------------------------------
-- Игнорирование размера букв при поиске
opt.ignorecase = true        --Игнорировать размер букв
opt.smartcase = true         --Игнор прописных букв

